tutorials/RAS/variableHeightDuct/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type         uniformFixedValue;
        uniformValue table
		(
			(0 (0 0 0))
			(5 (0.2 0 0))
			(100 (0.2 0 0))
		);
    }
    outlet
    {
        type       zeroGradient;
    }
    top
    {
        type       noSlip;
    }
    bed
    {
        //type       noSlip;
        type 	   movingWallVelocity;
        value      uniform (0 0 0);
    }
    sides
    {
        type       noSlip;
    }
}


// ************************************************************************* //
